[
	{
		"Jobs":"Manager-Corporate Development",
		"id":"1",
		"Posted Date":"18-Aug-18",
		"Business":"Corporate",
		"Function":"Alliances & Business Development",
		"Parent":"1",
		"Location":"Gurgaon",
		"Job Responsibilities":["The Incumbent will work on alliances, business development, and business strategy. This role works with Corporate Development & Digital Strategy lead across projects, New Business Prospecting, Business Analysis and MIS.","New BD prospecting","Business Analysis and MIS","Tracking and monitoring projects across Digital and TV","Working with Corporate Strategy Team across initiatives with the focus on research and insights.","Identify revenue growth avenues for Network 18 across digital and television.","Front-end Network 18 Alliances and partnerships with global media firms in digital and television space.","Deal structuring, commercial evaluation, and P&L projection & management for digital and television properties and alliances."],
		"Education Requirement":"MBA ",
		"Experience Requirement":"1-4 years",
		"Skills & Competencies":["Business and Product Understanding","Communication and negotiation skills."],
		"Recruiter":"Kiran.Jagtiani@nw18.com"
	},{
		"Jobs":"Lead-Branded Content",
		"id":"2",
		"Posted Date":"18-Aug-18",
		"Business":"Digital",
		"Function":"Campaign & Events",
		"Parent":"4",
		"Location":"Mumbai",
		"Job Responsibilities":["Understanding brand/client’s requirements and delivering content campaigns that suit their requirements","Good understanding of the home brand and thereby creating a good balance between editorial and paid content, so that the ‘branded content’ rests true within the website/product that houses it","Capability to ideate and create original and brand specific Intellectual Properties that can drive revenues","Capability to understand digital medium to design and suit content campaigns within the platform as per client’s requirements","Ability to create campaigns that are forward looking","Ability to be flexible to client’s requirements to deliver the campaign and ensure client returns","Ability to work under strict timelines and deliver campaigns on time"],
		"Education Requirement":"MBA",
		"Experience Requirement":"1-3 years",
		"Skills & Competencies":["Communication and negotiation skills"],
		"Recruiter":"Sylvia.Jose@nw18.com"
	},{
		"Jobs":"Senior Copy Editor / Copy Editor",
		"id":"3",
		"Posted Date":"18-Aug-18",
		"Business":"Digital",
		"Function":"Editorial & Content",
		"Parent":"5",
		"Location":"Bhubaneswar",
		"Job Responsibilities":["Ensure that all/relevant news items broadcasted on news channel are timely and correctly typed, converted into right format and uploaded on the website.","Write articles and features on the website to increase the traffic and attract more audience on the website.","Take higher responsibilities to enhance their professional knowledge and skills.","Suggest and implement improvement in the process and work flow to increase the team productivity"],
		"Education Requirement":"Graduate/Diploma in Journalism",
		"Experience Requirement":"0-3 years",
		"Skills & Competencies":["Written Language skill","Domain Knowledge"],
		"Recruiter":"Varsha.sinha@nw18.com"
	},{
		"Jobs":"Copy editor",
		"id":"4",
		"Posted Date":"18-Aug-18",
		"Business":"Digital",
		"Function":"Editorial & Content",
		"Parent":"5",
		"Location":"Mumbai",
		"Job Responsibilities":["Ensure that all/relevant news items broadcasted on news channel are timely and correctly typed, converted into right format and uploaded on the website.","Write articles and features on the website to increase the traffic and attract more audience on the website.","Take higher responsibilities to enhance their professional knowledge and skills.","Suggest and implement improvement in the process and work flow to increase the team productivity"],
		"Education Requirement":"Graduate/Diploma in Journalism",
		"Experience Requirement":"3 - 5 years",
		"Skills & Competencies":["Written Language skill","Domain Knowledge"],
		"Recruiter":"Sylvia.Jose@nw18.com"
	},{
		"Jobs":"Assistant Manager - Accounts",
		"id":"5",
		"Posted Date":"18-Aug-18",
		"Business":"Corporate",
		"Function":"Finance & Accounts",
		"Parent":"6",
		"Location":"Mumbai",
		"Job Responsibilities":["Preparation of Consolidated Financial Statements & Notes on accounts.","Preparation of Financial Statements and Notes on Accounts.","Review of Trial Balance and GL scrutiny.","Preparation of Related Party Statement.","Checking Computation of Income under Income Tax Act.","Co-coordinating with Statutory Auditors.","Overall governance of Internal Financial Controls ","Preparation of required data related to financials for Board Meeting. "],
		"Education Requirement":"CA",
		"Experience Requirement":"2-4 years",
		"Skills & Competencies":["Strong knowledge of SAP & proficient in MS-Excel."],
		"Recruiter":"Kiran.Jagtiani@nw18.com"
	},{
		"Jobs":"Assistant Manager - Commercial",
		"id":"6",
		"Posted Date":"18-Aug-18",
		"Business":"Corporate",
		"Function":"Finance & Accounts",
		"Parent":"6",
		"Location":"Hyderabad",
		"Job Responsibilities":["To manage the Purchasing activities of Television / Digital Business of TV18/NW18. The person will work as part of the corporate purchasing team to serve all the business.","To manage proactively the material/service Purchasing activities across all the sites. Ensuring that appropriate Legislative and compliance targets are set and delivered. Make strategy for cost reduction in Material/Services, common consumables through alternate sourcing and market intelligence. Establish a relationship with local site management teams, which delivers compliance to corporate contracts and preferred supplier lists. Deliver robust regular reports of performance measures. Lead and assist in negotiations with suppliers. Establish innovative contracts with key suppliers to deliver optimum service at minimum cost. Rationalize the supply base. Develop strong relationships with suppliers involving them in local site problem resolution. Leverage consolidated volume of all the units and drive the cost savings.","Procurement of Capex Items, Consumables, AMC/CAMC agreements, FMS, Security Services, Civil Items, RFQs, Comparative Statements, Negotiation, PO Preparation, Follow up for deliveries , Expenses Analysis, Documentation. Handling sourcing through identification of cost effective vendors/suppliers for procurement with an aim of reducing cost while improving quality & reliability.","Designing & scheduling material procurement plans for Capital items, Consumable items.","Coordinating with other departments for material requirement planning, material procurement & purchase planning, ensuring continuous supply.","Identifying and developing alternate vendor source for localization, achieving cost effective purchases of all materials with reduction in delivery time and improve consistency in quality.","Assessing the performance of the vendors based on various criterions such as quality systems, rejections, quality improvement rate, timely delivery etc.","Developing quality culture at vendors end through auditing and guidance.","Spearheading Value Analysis continuous improvement initiatives in processes. ","Implementing strict measures in operating procedures to optimize resource/capacity utilization.","Manage internal and external customer relationships, to work through members of the purchasing and business management organizations in some cases external business partners in order to maintain and build the relationship and to achieve the organizational objective."],
		"Education Requirement":"Graduate",
		"Experience Requirement":"6-8 years",
		"Skills & Competencies":["Experience in Supply Chain Management/Sourcing/Procurement ","Have experience in Purchasing, Planning, Vendor Development ,Export/ Import, Capital equipment ","A proven leadership skill in making a significant contribution towards developing and improving the procurement function.","The jobholder will need to have strong concern for impact and strong results orientation, and will need to demonstrate both strategic and conceptual thinking skills and have a high degree of tenacity.","The candidate should have good communication and leadership skills. ","Proficiency in SAP MM module."],
		"Recruiter":"Kiran.Jagtiani@nw18.com"
	},{
		"Jobs":"Manager-Legal",
		"id":"7",
		"Posted Date":"18-Aug-18",
		"Business":"Corporate",
		"Function":"Legal",
		"Parent":"8",
		"Location":"Noida",
		"Job Responsibilities":["Review contracts of allocated business/ functions and provide advisory to the head in case any changes are required","Check for compliance to regulatory and governmental norm and suggest ways to ensure adherence","Scan for risks and advice heads regarding ways to mitigate the same","Prepare response to notices received and ensure closure of issues within the minimum turnaround time","Provide legal protection and risk management advice to management relating to any aspect of business","Work towards continuously raising the capability quotient to ensure relevance of all advises given to business"],
		"Education Requirement":"Law Graduate",
		"Experience Requirement":"4-5 Years",
		"Skills & Competencies":["Commercial Contracting","Litigation Management","Media Laws","MS Office & Adobe"],
		"Recruiter":"Kiran.Jagtiani@nw18.com"
	},{
		"Jobs":"Assistant Product Manager / Product Manager",
		"id":"8",
		"Posted Date":"18-Aug-18",
		"Business":"Digital",
		"Function":"Product",
		"Parent":"9",
		"Location":"Mumbai",
		"Job Responsibilities":["Collect and analyse data, both internal and competition, and share it with the management for making strategic decisions","Use the data intelligence to design and develop new products (features, articles series) and attract new viewers","Act as interface between Content and Technology team and  Maintains the Social networking sites like twitter, app, whatsapp etc.","Study the competition- their products, Social Networking sites and analyses the gap and make suggestion for  filling the gaps","Analyze customer preferences and ideate on the features that can be added to the product to increase traffic and consequently revenues","Design roadmap for the brand and draft plans for brand refurbishment as and when required","Execute sales campaign by liaisoning with design team and decide on the placement of banner to comply with the terms of sales contract","Ideate product layout to enhance customer experience","Track product traffic daily and analyze the product usage data to chart out plans to increase traffic"],
		"Education Requirement":"Graduate / MBA",
		"Experience Requirement":"5-10 years",
		"Skills & Competencies":["Knowledge of Statistical tools for data analysis; Programming in digital eco-space","Product life-cycle","Project Management","Statistical Tools"],
		"Recruiter":"Himanshu.desai@nw18.com"
	},{
		"Jobs":"Senior Graphic Designer",
		"id":"9",
		"Posted Date":"18-Aug-18",
		"Business":"Broadcasting",
		"Function":"Production",
		"Parent":"10",
		"Location":"Mumbai",
		"Job Responsibilities":["Understand the requirement from output team and develop most engaging graphics for news bulletings, program promos and special coverages.","Deliver maps, charts, information graphics and branding to support daily output ","Create online graphics elements based on standard templates, quality standards and timeline requirements. ","Use time management techniques of effectively schedule your work and ensure delivery as per the timelines.","Develop own capabilities as skilled online graphics professionals on the job and by attending trainings ","Upgrade own understanding and knowledge of emerging technologies / skills under the guidance of Team Lead - Online Graphics.","Contribute design expertise to special project groups formed for execution of critical or prestigiuos projetcs."],
		"Education Requirement":"Graduate (Mass Communication and / or Graphics course preferred)",
		"Experience Requirement":"2-5 years ",
		"Skills & Competencies":["Online Graphics Techniques","VizRT and other graphics software(s)","Production processes"],
		"Recruiter":"Varsha.sinha@nw18.com"
	},{
		"Jobs":"Account Manager / Account Group Head – Display Sales",
		"id":"10",
		"Posted Date":"18-Aug-18",
		"Business":"Broadcasting",
		"Function":"Revenue Management",
		"Parent":"11",
		"Location":"Mumbai / Bangalore / Gurgaon / Kolkata / Chandigarh",
		"Job Responsibilities":["Maximize FCT (Fixed Commercial Time) revenue from assigned accounts","Forecast revenues for the fortnight and month. Identify issues and seek help from team leads for clinching important deals.","Manage relations effectively with key clients and agencies to ensure retention of existing clients, increase in wallet share and revenue from existing. Acquire new clients to broaden revenue base. ","Adhere to pricing bands of the channel","Maximize deal consumption from advertisers. Work along with the sales operations team for smooth delivery of client expectations.","Ensure maximization of timely collection","Scan competitive landscape and ideate on new formats which can augment revenues.","Develop advanced skills and competencies required for the job by attending trainings organized at the organization"],
		"Education Requirement":"PG / MBA",
		"Experience Requirement":"1-5 Years",
		"Skills & Competencies":["Business Understanding (Value Chain, Competition Market Pricing, ER, Inventory)","Product Understanding","Communication and Negotiation skills"],
		"Recruiter":"Amita.Achary@nw18.com"
	},{
		"Jobs":"Account Manager – Focus Sales",
		"id":"11",
		"Posted Date":"18-Aug-18",
		"Business":"Broadcasting",
		"Function":"Revenue Management",
		"Parent":"11",
		"Location":"Mumbai / Gurgaon",
		"Job Responsibilities":["Responsible for revenue generation, through combination of IP's, event sponsorships, & media partnerships (non-FCT) for industry-specific verticals","Manage key accounts and be personally responsible for managing relationships with key accounts","Grow business for applicable verticals, involving travel to other cities across the country","Formulate and implement ideas, ensuring they are aligned with the business strategies","Adhere to pricing as per the band prescribed by Regional head / Team Lead ","Conduct robust market analysis, planning and implementation through different media vehicles to deliver outstanding client benefits","Identify any problem areas, devise and deliver solutions","Work along with the event execution team for smooth delivery of client expectations.","Develop advanced skills and competencies required for the job by attending trainings organized at the organization"],
		"Education Requirement":"PG / MBA",
		"Experience Requirement":"1-6 Years",
		"Skills & Competencies":["Business and Product Understanding","Communication and negotiation skills","Sales Execution "],
		"Recruiter":"Amita.Achary@nw18.com"
	},{
		"Jobs":"Account Manager / Senior Account Manager / Group Head – Sales",
		"id":"12",
		"Posted Date":"18-Aug-18",
		"Business":"Digital",
		"Function":"Revenue Management",
		"Parent":"11",
		"Location":"Mumbai / Gurgaon / Bangalore",
		"Job Responsibilities":["Support  yearly sales plan and ensure achievement of the same through effective deployment","Maximize revenue collections by increasing client count and wallet share in the markets ","Ideate new avenues to increase sales opportunity and educate team members about the same","Manage relationships with clients through effective interactions and networking","Liaise with Focus and Editorial team to monetize Focus sales opportunity"],
		"Education Requirement":"Graduate",
		"Experience Requirement":"2 - 5 years",
		"Skills & Competencies":["Client Acquisition","Sales proposals development","Product Understanding","Communication and negotiation skills"],
		"Recruiter":"Himanshu.desai@nw18.com"
	},{
		"Jobs":"Account Manager / Senior Account Manager / Group Head – Sales",
		"id":"13",
		"Posted Date":"18-Aug-18",
		"Business":"Digital",
		"Function":"Revenue Management",
		"Parent":"11",
		"Location":"Mumbai / Gurgaon / Bangalore",
		"Job Responsibilities":["Managing a revenue target assigned and achieving it on a month on month basis.","Meeting clients and agencies and making relevant pitches to secure deals","Executing deals that have been signed and making sure all commitments are delivered.","Gaining and in depth understanding of the business and network18 platforms and coming up with solutions that can be monetized for the network.","Sign up with new clients and drive revenues from new categories","Execute Branded Content Deals with the help of ideation team","An expert in integrated marketing solutions who will educate teammates on how to sell these services","A consultative problem-solver specialized in selling large bespoke branded content solutions to enterprise clients","Someone who manages time and prioritizes effectively to meet deadlines and client expectations"],
		"Education Requirement":"Graduate / MBA degree ",
		"Experience Requirement":"3-10 years",
		"Skills & Competencies":["Experience in closing $1M+ deals.Trusted relationships with C-Level marketing decision makers at strategic brands, ad agencies, tech platforms and/or publishers.Excellent communication and client-management skills"],
		"Recruiter":"Himanshu.desai@nw18.com"
	},{
		"Jobs":"Account Manager / Senior Account Manager / Group Head (Programmatic Sales)",
		"id":"14",
		"Posted Date":"18-Aug-18",
		"Business":"Digital",
		"Function":"Revenue Management",
		"Parent":"11",
		"Location":"Mumbai/Bangalore",
		"Job Responsibilities":["Responsible for accurate implementation of monetization strategies across digital channels and products.","Analyze, troubleshoot and proactively develop recommendations for channel and product optimization to maximize revenue opportunities.","Main point of contact for digital monetization partners, as well as daily interactions with yield reporting systems, inventory management systems, ad serving and forecasting systems.","Maintains working relationships with Digital Channel Managers, 3rd party vendors/partners, operations and project managers.","Identify growth opportunities and strategies to meet company goals","Familiarity with digital product monetization and corresponding sales strategies from both programmatic and third party network sales.","Above par understanding of and exposure to Real Time Bidding, Private Market Place, SSPs & DSPs.","Knowledge of and familiarity with digital media landscape, including experience with vendor selection and relationship management, as a function of adding ongoing sales efforts.","Proficient with digital media integration and corresponding measurement tools: Google Analytics, etc.","Strong communication and presentation skills"],
		"Education Requirement":"Graduate / MBA degree/BE/BTech ",
		"Experience Requirement":"3-7 years",
		"Skills & Competencies":["Knowledge of and familiarity with digital media landscape, including experience with vendor selection and relationship management, as a function of adding ongoing sales efforts.Proficient with digital media integration and corresponding measurement tools: Google Analytics, etc. Strong communication and presentation skills"],
		"Recruiter":"Himanshu.desai@nw18.com"
	},{
		"Jobs":"Dot Net Developers",
		"id":"15",
		"Posted Date":"18-Aug-18",
		"Business":"Corporate",
		"Function":"Technology & Operations",
		"Parent":"13",
		"Location":"Mumbai",
		"Job Responsibilities":["Understand customer requirement and ideate ways for IT system improvement","Develop IT system for the user based upon  requirements and integrate the same with existing systems","Document solutions by developing  flowcharts, layouts, diagrams, charts and code comments","Conduct extensive testing of the developed system to ensure error free operations","Deploy the developed solution and monitor day to day working to ensure bug free operations","Monitor and review current IT systems and make suitable modification as required depending on any environmental change or change in user requirements"],
		"Education Requirement":"BE/ B.Tech ",
		"Experience Requirement":"3- 8 Years",
		"Skills & Competencies":["Hardware & Software Knowledge","Process Development","Research Orientation"],
		"Recruiter":"Neha.bhaidkar@nw18.com"
	},{
		"Jobs":"Executive-MCR",
		"id":"16",
		"Posted Date":"18-Aug-18",
		"Business":"Broadcasting",
		"Function":"Technology & Operations",
		"Parent":"13",
		"Location":"Mumbai",
		"Job Responsibilities":["Maintain a zero error for transmission of each channel on a daily basis.","Check content availability on server/ ingest system of all the content/ advertisement packages to be played out as per Run Down Report","Review each package (content/ advertisement) for quality and accuracy (quality in terms of on air playout and accurancy in terms of relevance and timing)","Monitor content being played out on alloted channel continuously. In case of failure of content, switch playout server from 'Main' to 'Backup' and lastly 'Filler'. ","Escalate any issues with content/ advertisement/ Run Down Report to Team Lead - Playout"],
		"Education Requirement":"Graduate/ Diploma",
		"Experience Requirement":"0-5 years",
		"Skills & Competencies":["Hardware & Software Knowledge","Process Development","Quality Control"],
		"Recruiter":"Neha.bhaidkar@nw18.com"
	}
]